# Задача:
# На вхід до програми подається число n - Кількість собачих років. Напишіть програму, яка обчислює вік собаки у людських роках.
# Формат вхідних даних
# На вхід програмі подається натуральне число – кількість собачих років.
# Формат вихідних даних
# Програма має вивести вік собаки у людських роках.

# Примітка. Протягом перших двох років собачий рік дорівнює
# 10.5 людських років. Після цього рік собаки дорівнює 4 людських років.

# Підказка: Використовуйте умови

def dogYearsCalculator():
    dogYears = int(input('Введіть вік вашої собаки: '))
    humanYears = 0

    for i in range (1, dogYears+1):
        if i <= 2:
            humanYears = humanYears + 10.5
        else:
            humanYears = humanYears + 4
    print (str(humanYears) + " років")
    

indicator = 1

while indicator == 1:
    answer = input('Хочете перевести вік своєї собаки в людський?: ').lower()
    if answer == 'так':
        dogYearsCalculator()
        indicator = 1
    elif answer == 'ні':
        indicator = 0