# Задача №2
# Дано два натуральні числа
# m і n (m≤n). Напишіть програму, яка виводить усі цілі числа від m до n включно, що задовольняють хоча б одній із умов:

# число кратне 17;
# число закінчується на 9;
# число кратне 3 та 5 одночасно.
# Формат вхідних даних
# На вхід програмі подаються два натуральні числа
# m і n (m≤n), кожне на окремому рядку.

# Формат вихідних даних
# Програма має вивести числа відповідно до умови завдання.

# Примітка. Якщо немає чисел, які задовольняють умові, виводити нічого не треба.

m = int(input("введіть число: "))
n = int(input("введіть ще одне число: "))

for i in range(m, n+1):
    if i % 17 == 0 or i % 10 == 9 or (i % 3 == 0 and i % 5 == 0):
        print(i)