# Манхеттенська відстань
# Прогулюючись Манхеттеном, ви не можете потрапити з точки А в точку Б по найкоротшому шляху. Якщо ви не вмієте проходити крізь стіни, вам обов'язково доведеться йти вздовж його паралельно-перпендикулярних вулиць.
# На площині манхеттенська відстань між двома точками
# (p1; p2) і (q1; q2) визначається так | p1-q1 | + | p2-q2 |.
# Напишіть програму, що визначає манхеттенську відстань між двома точками, координати яких задані.


# Формат вхідних даних 
# На вхід до програми подається чотири цілих числа, кожне на окремому рядку –p1, p2, q1, q2. 
# Формат вихідних даних
# Програма має вивести одне число – манхеттенську відстань.

i = 1
while i == 1:
    p1 = int(input("Введіть значення p1: "))
    p2 = int(input("Введіть значення p2: "))
    q1 = int(input("Введіть значення q1: "))
    q2 = int(input("Введіть значення q2: "))

    manhattanDistance = abs(p1 - q1) + abs(p2 - q2)
    print("Манхеттенська відстань:", manhattanDistance)

    answer = input("Хочете порахувати ще? ")
    if answer == "так":
        i = 1
    else:
        i = 0