# Задача №2
# Зірковий трикутник
# На вхід програмі подається натуральне число
# n(n≥2) – катет прямокутного рівнобедреного трикутника.

# Напишіть програму, яка виводить зірковий трикутник відповідно до прикладу.

# Формат вхідних даних
# На вхід до програми подається одне натуральне число
# n(n≥2).

# Формат вихідних даних
# Програма має вивести трикутник відповідно до умови завдання.


# Sample Input 1:
# 3
# Sample Output 1:
# ***
# **
# *

n = int(input("Введіть натуральне число n (n≥2): "))

for i in range(n, 0, -1):
    print('*' * i)